#### NonContinuousRailInfo Members

---

|  |
| --- |
| NonContinuousRailInfo Class   Methods   Properties   See Also |

The  NonContinuousRailInfo  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  NonContinuousRailInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsValidNonContinuousRailHeight | Checks whether the input height is valid for a non-continuous rail in its associated railing type. |
| Public method | IsValidNonContinuousRailMaterial | Checks whether an ElementId is a valid material Id of a non-continuous rail. |
| Public method | IsValidNonContinuousRailName | Checks whether the input name is valid for a non-continuous rail in its associated railing type. |
| Public method | IsValidNonContinuousRailProfile | Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Height | The height at which the non-continuous rail will be placed. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MaterialId | The material id associated with the non-continuous rail, or invalidElementId if none. |
| Public property | Name | The name of the non-continuous rail. |
| Public property | Offset | The side offset of the non-continuous rail from a  [!:Autodesk::Revit::DB::Architecture::Railing]  from the railing center. |
| Public property | ProfileId | The profile id of the non-continuous rail, or invalidElementId if none. |

# See Also

NonContinuousRailInfo Class

Autodesk.Revit.DB.Architecture Namespace